# Hour Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Hour Property
SymbolTypeId Class See Also
---
Symbol h, indicating unit Hours.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Hour { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Hour As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Hour {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace